# Parameters
nc: 1  # number of classes
depth_multiple: 0.33
width_multiple: 0.50

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 3, C2f, [64, True]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 3, C2f, [1024, True]]

# PBFPNb-method1 head
head:
  - [-1, 1, Conv, [512, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]

  - [-1, 3, C3, [512, False]]
  - [-1, 1, Conv, [256, 1, 1]]

  - [6, 3, C3, [256, False]]
  - [-1, 1, Conv, [256, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]

  - [-1, 3, C3, [256, False]]
  - [-1, 1, Conv, [128, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]

  - [-1, 3, C3, [128, False]]
  - [-1, 1, Conv, [64, 1, 1]]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 1], 1, Concat, [1]]

  - [-1, 3, C3, [64, False]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 25], 1, Concat, [1]]

  - [-1, 3, C3, [128, False]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 21], 1, Concat, [1]]

  - [ -1, 3, C3, [ 256, False ] ]
  - [ -1, 1, Conv, [ 256, 3, 2 ] ]
  - [ [ -1, 15 ], 1, Concat, [ 1 ] ]

  - [ -1, 3, C3, [ 512, False ] ]
  - [ -1, 1, Conv, [ 512, 3, 2 ] ]
  - [ [ -1, 11 ], 1, Concat, [ 1 ] ]

  - [ -1, 3, C3, [ 1024, False ] ]

  - [[28, 31, 34, 37, 40], 1, Detect, [nc]] 
