# Parameters
nc: 1  # number of classes
depth_multiple: 0.33
width_multiple: 0.50

# Ta-conv with weights backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TripletAttention_Conv_w, [64, 3, 2]]
  - [-1, 3, C2f, [64, True]]
  - [-1, 1, TripletAttention_Conv_w, [128, 3, 2]]
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, TripletAttention_Conv_w, [256, 3, 2]]
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, TripletAttention_Conv_w, [512, 3, 2]]
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, TripletAttention_Conv_w, [1024, 3, 2]]
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

# FPN+PAN head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 3, C2f, [256]]

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 3, C2f, [512]]

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 3, C2f, [1024]]

  - [[16, 19, 22], 1, Detect, [nc]] 